#### Terraform Initialization ⚙️`success`
#### Terraform Format  🖌`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan Changes</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
/production/ relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/revolgy/revolgy/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/revolgy/revolgy

To view this run in a browser, visit:
https://app.terraform.io/app/revolgy-infra/production/runs/run-tQ3N7ahpaaW58z8N

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
module.eks.aws_vpc.main: Refreshing state... [id=vpc-0da5b464c1035b8a8]
module.eks.aws_iam_role.nodes_general: Refreshing state... [id=eks-node-group-general]
module.eks.aws_iam_role.eks_cluster: Refreshing state... [id=eks-cluster]
module.eks.aws_iam_role_policy_attachment.amazon_ec2_container_registry_read_only: Refreshing state... [id=eks-node-group-general-20220517125448158200000002]
module.eks.aws_iam_role_policy_attachment.amazon_eks_cni_policy_general: Refreshing state... [id=eks-node-group-general-20220517125448177300000004]
module.eks.aws_iam_role_policy_attachment.amazon_eks_worker_node_policy_general: Refreshing state... [id=eks-node-group-general-20220517125448169400000003]
module.eks.aws_iam_role_policy_attachment.amazon_eks_cluster_policy: Refreshing state... [id=eks-cluster-20220517125448150600000001]
module.eks.aws_subnet.public_1: Refreshing state... [id=subnet-0c38a72efeaeaf527]
module.eks.aws_subnet.public_2: Refreshing state... [id=subnet-0344449d6a2062269]
module.eks.aws_internet_gateway.main: Refreshing state... [id=igw-0cb1fde7a0f4520ba]
module.eks.aws_security_group.allow-tcp: Refreshing state... [id=sg-0c9b570dd1f323916]
module.eks.aws_subnet.private_2: Refreshing state... [id=subnet-02c4c584b15096ec8]
module.eks.aws_subnet.private_1: Refreshing state... [id=subnet-07608aa98bd0f6b03]
module.eks.aws_eip.nat2: Refreshing state... [id=eipalloc-0ad38f39c7bc0840b]
module.eks.aws_eip.nat1: Refreshing state... [id=eipalloc-098c08a9584638375]
module.eks.aws_route_table.public: Refreshing state... [id=rtb-043e6c341cf3a784b]
module.eks.aws_security_group_rule.outgoing: Refreshing state... [id=sgrule-2692002273]
module.eks.aws_db_subnet_group.database-subnet-group: Refreshing state... [id=database subnets]
module.eks.aws_eks_cluster.eks: Refreshing state... [id=eks]
module.eks.aws_route_table_association.public2: Refreshing state... [id=rtbassoc-050798feadeb26a09]
module.eks.aws_route_table_association.public1: Refreshing state... [id=rtbassoc-0e660952e47ae2aca]
module.eks.aws_nat_gateway.gw2: Refreshing state... [id=nat-0e22c6e72f5f6f7c3]
module.eks.aws_nat_gateway.gw1: Refreshing state... [id=nat-090dc74d044370ebb]
module.eks.aws_route_table.private2: Refreshing state... [id=rtb-045358635389eab9b]
module.eks.aws_route_table.private1: Refreshing state... [id=rtb-008673345233ad7e6]
module.eks.aws_db_instance.postgres: Refreshing state... [id=terraform-20220517125459891800000005]
module.eks.aws_route_table_association.private2: Refreshing state... [id=rtbassoc-031b2b85f6aad8050]
module.eks.aws_security_group_rule.db-security-group-rule-allow-all: Refreshing state... [id=sgrule-3880915676]
module.eks.aws_eks_node_group.nodes_general: Refreshing state... [id=eks:nodes-general]
module.eks.aws_route_table_association.private1: Refreshing state... [id=rtbassoc-04152fd27372f37f9]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.aws_db_instance.postgres has changed
  ~ resource "aws_db_instance" "postgres" {
        id                                    = "terraform-20220517125459891800000005"
        name                                  = "postgres"
      + security_group_names                  = []
      + tags                                  = {}
        # (57 unchanged attributes hidden)
    }

  # module.eks.aws_eip.nat1 has changed
  ~ resource "aws_eip" "nat1" {
      + association_id       = "eipassoc-0480a60a3661d58c3"
        id                   = "eipalloc-098c08a9584638375"
      + network_interface    = "eni-0ec9c0e8d519bc3e0"
      + private_dns          = "ip-192-168-48-213.us-east-2.compute.internal"
      + private_ip           = "192.168.48.213"
      + tags                 = {}
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_eip.nat2 has changed
  ~ resource "aws_eip" "nat2" {
      + association_id       = "eipassoc-07876bb38733da737"
        id                   = "eipalloc-0ad38f39c7bc0840b"
      + network_interface    = "eni-092bf361a5324e527"
      + private_dns          = "ip-192-168-73-183.us-east-2.compute.internal"
      + private_ip           = "192.168.73.183"
      + tags                 = {}
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_eks_cluster.eks has changed
  ~ resource "aws_eks_cluster" "eks" {
      + enabled_cluster_log_types = []
        id                        = "eks"
        name                      = "eks"
      + tags                      = {}
        # (10 unchanged attributes hidden)


      ~ vpc_config {
          + security_group_ids        = []
            # (6 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_node_group.nodes_general has changed
  ~ resource "aws_eks_node_group" "nodes_general" {
        id                   = "eks:nodes-general"
      + tags                 = {}
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.eks.aws_iam_role.eks_cluster has changed
  ~ resource "aws_iam_role" "eks_cluster" {
        id                    = "eks-cluster"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
        ]
        name                  = "eks-cluster"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_iam_role.nodes_general has changed
  ~ resource "aws_iam_role" "nodes_general" {
        id                    = "eks-node-group-general"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          + "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          + "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ]
        name                  = "eks-node-group-general"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_security_group.allow-tcp has changed
  ~ resource "aws_security_group" "allow-tcp" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "192.168.0.0/16",
                ]
              + description      = "Allow all outgoing"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0c9b570dd1f323916"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow all communication from eks nodes"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-01791ae0ce0d05733",
                ]
              + self             = false
              + to_port          = 65535
            },
        ]
        name                   = "allow-tcp"
        tags                   = {
            "Name" = "security group db"
        }
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.db-security-group-rule-allow-all has changed
  ~ resource "aws_security_group_rule" "db-security-group-rule-allow-all" {
      + cidr_blocks              = []
        id                       = "sgrule-3880915676"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.outgoing has changed
  ~ resource "aws_security_group_rule" "outgoing" {
        id                = "sgrule-2692002273"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.eks.aws_eks_cluster.eks must be replaced
-/+ resource "aws_eks_cluster" "eks" {
      ~ arn                       = "arn:aws:eks:us-east-2:456131486398:cluster/eks" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1EVXhOekV6TURFd09Wb1hEVE15TURVeE5ERXpNREV3T1Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTG1XCk9RSlpHT0VkT05VM1JFVm1nM1hGemNXb29wMkVHQXpmLzRHbUNPK1ZkRGZvbldYVlYrNjlnYkJnYmp0THFzOWMKOElMZ1o3S2JmZXBVNGlMMm9WUzNrYk03aTZtL2dOUkdJTFBqZXRUQXpGNjVFazVCY0dJOTFHOEpncnBDdzlGVgpwcEUzaFdNc0N4TFdyVm5JaXV0dnZkRDRETEI5OVZnbm1pUjRaWkpCSC9aQ2FhRFdkSGY5QmE2bEd6YWRRVllRCmo2S095UFZ2YmNtYkZGOWJGZlZlNngrR3RSRFpZdGJRZUNUaXExeEhMcHl1aTE2TitQNXdESmxNRWhIY0VEYnMKNW5XYWp6SnlxR0l1Uld0MEhQczVqY3QvcWk5YmorajZXYUlRWk01dGNHb0QvTnpzQllWam4zUDhWbHlZUGZCWgpmRHBJQVI1MFgvY0hFK21XVWEwQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZKUEF1b256TkhNQ1kwcTUvYmhFQ3lHSmRtQjNNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFDQk5LcEtMYzI4KzNTNHhpU3VEVjFLL2g0a2pmczJmVjZ1YnRWR3ZOcURmQWV4ZXgrWAo2YlVtSHRYK1ltV1UwdGt3UU9QSUZwN0Q0Q1A0M0wxcWxTWXZOTnVQMmZ1OTBqcWk4WHdCZWY3d0FSR04wRHcxCmdsbUxzNW5OTStRbzVqeFExSmk2S2VvWTI4ZFBUYTROV2x5QmtEME9jV3JsOS90N3Q2NnlDZmtFOXptbE43UlcKNzBhTEJCeUdXNy8rQVJKS3ZkNDVxWE50Z1BlR01zQzY3ZmZ1Q2JJdDBqSFpweEhKNlgxcndFalR6RTJiUWpncQp3cmtTTGtNblQySkRsVWVZMVJDcU1FV1dGRWlSeHlzbjRwdVVzNlBCeFY1NHEvbkRsRTU0OXEwYXBzS1NqbE1JCmVSTWJSeGp5S1hSbmVaVUR2VXViQmJWTmFDaTdScVVGR3BlaQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2022-05-17 12:55:10.215 +0000 UTC" -> (known after apply)
      - enabled_cluster_log_types = [] -> null
      ~ endpoint                  = "https://85981CB800B1D7047797A6C22811998A.gr7.us-east-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "eks" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-2.amazonaws.com/id/85981CB800B1D7047797A6C22811998A"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "eks"
      ~ platform_version          = "eks.5" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::456131486398:role/eks-cluster" -> (known after apply) # forces replacement
      ~ status                    = "ACTIVE" -> (known after apply)
      - tags                      = {} -> null
      ~ tags_all                  = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ kubernetes_network_config {
          ~ ip_family         = "ipv4" -> (known after apply)
          ~ service_ipv4_cidr = "10.100.0.0/16" -> (known after apply)
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-01791ae0ce0d05733" -> (known after apply)
          ~ public_access_cidrs       = [
              - "0.0.0.0/0",
            ] -> (known after apply)
          - security_group_ids        = [] -> null
          ~ vpc_id                    = "vpc-0da5b464c1035b8a8" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.eks.aws_eks_node_group.nodes_general must be replaced
-/+ resource "aws_eks_node_group" "nodes_general" {
      ~ arn                    = "arn:aws:eks:us-east-2:456131486398:nodegroup/eks/nodes-general/82c0690f-aad5-9e89-02d6-0a4ef420eb4a" -> (known after apply)
      ~ id                     = "eks:nodes-general" -> (known after apply)
      + node_group_name_prefix = (known after apply)
      ~ node_role_arn          = "arn:aws:iam::456131486398:role/eks-node-group-general" -> (known after apply) # forces replacement
      ~ release_version        = "1.20.11-20220429" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-82c0690f-aad5-9e89-02d6-0a4ef420eb4a"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (10 unchanged attributes hidden)


      ~ update_config {
          ~ max_unavailable            = 1 -> (known after apply)
          ~ max_unavailable_percentage = 0 -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # module.eks.aws_iam_role.eks_cluster must be replaced
-/+ resource "aws_iam_role" "eks_cluster" {
      ~ arn                   = "arn:aws:iam::456131486398:role/eks-cluster" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "eks.amazonaws.com"
                        }
                    },
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "ec2.amazonaws.com"
                        }
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2022-05-17T12:54:47Z" -> (known after apply)
      ~ id                    = "eks-cluster" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
        ] -> (known after apply)
      ~ name                  = "eks-cluster" -> "eks_cluster_role_prod" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAWUM4OEK7NMWTGAAQY" -> (known after apply)
        # (3 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role.nodes_general must be replaced
-/+ resource "aws_iam_role" "nodes_general" {
      ~ arn                   = "arn:aws:iam::456131486398:role/eks-node-group-general" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "ec2.amazonaws.com"
                        }
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2022-05-17T12:54:47Z" -> (known after apply)
      ~ id                    = "eks-node-group-general" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          - "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ] -> (known after apply)
      ~ name                  = "eks-node-group-general" -> "eks_node_group_role_prod" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAWUM4OEK7PA4LXM622" -> (known after apply)
        # (3 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.amazon_ec2_container_registry_read_only must be replaced
-/+ resource "aws_iam_role_policy_attachment" "amazon_ec2_container_registry_read_only" {
      ~ id         = "eks-node-group-general-20220517125448158200000002" -> (known after apply)
      ~ role       = "eks-node-group-general" -> "eks_node_group_role_prod" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.amazon_eks_cluster_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "amazon_eks_cluster_policy" {
      ~ id         = "eks-cluster-20220517125448150600000001" -> (known after apply)
      ~ role       = "eks-cluster" -> "eks_cluster_role_prod" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.amazon_eks_cni_policy_general must be replaced
-/+ resource "aws_iam_role_policy_attachment" "amazon_eks_cni_policy_general" {
      ~ id         = "eks-node-group-general-20220517125448177300000004" -> (known after apply)
      ~ role       = "eks-node-group-general" -> "eks_node_group_role_prod" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.amazon_eks_worker_node_policy_general must be replaced
-/+ resource "aws_iam_role_policy_attachment" "amazon_eks_worker_node_policy_general" {
      ~ id         = "eks-node-group-general-20220517125448169400000003" -> (known after apply)
      ~ role       = "eks-node-group-general" -> "eks_node_group_role_prod" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_security_group_rule.db-security-group-rule-allow-all must be replaced
-/+ resource "aws_security_group_rule" "db-security-group-rule-allow-all" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-3880915676" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ source_security_group_id = "sg-01791ae0ce0d05733" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

Plan: 9 to add, 0 to change, 9 to destroy.


```

</details>



*Pusher: @Bash-mocart, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*